{
    "news": [
    {
        "headlines": "'Messi, Ronaldo lead the way'",
        "text": "Lionel Messi and Cristiano Ronaldo are the only two players who have won the award more than three times..."
    },    
    {
        "headlines": "'Arsenal 2021-22 kit: New home and away jersey styles & release dates'",
        "text": "Goal takes a look at what the Gunners' latest home, away and third kits are rumoured to look like"
    },    
    {
        "headlines": "'Barcelona suspect Real Madrid are behind Moriba stalling on new contract'",
        "text": "The Blaugrana are struggling to put fresh terms in place with a hot prospect, but contact with the Blancos is being denied"
    },    
    {
        "headlines": "'Sarr 'surprised' that Chelsea wanted to sign him as he looks to make Blues breakthrough'",
        "text": "The 22-year-old defender attracted plenty of interest in the summer of 2020, but a switch to Stamford Bridge still came as a shock"
    },    
    {
        "headlines": "'Sudeikis wears t-shirt in support of Rashford, Sancho & Saka at Ted Lasso premiere'",
        "text": "The lead actor called the racist abuse of the players after their penalty misses in the Euro final 'horrible'"
    },    
    {
        "headlines": "'The final agreement insults club members' - East Bengal Executive Committee will not sign final agreement'",
        "text": "The committee maintain their stance on not signing final agreement of the JV which was to be formed between East Bengal and Shree Cement..."
    },    
    {
        "headlines": "'‘The USWNT should not lose’ - Hope Solo previews the 2020 Olympic Games and reflects on controversy at Rio 2016'",
        "text": "The U.S. women’s national team legend was speaking on Goal’s new podcast, All Of US: The U.S. Women's Soccer Show"
    },    
    {
        "headlines": "'Celtic sign Japan international Kyogo Furuhashi from Vissel Kobe'",
        "text": "The winger has been in great form for Vissel Kobe and tops the goal charts in Japan at the midway point of the season"
    },    
    {
        "headlines": "'STEVEN GERRARD GIVES EX-LIVERPOOL TEAM-MATE GLOWING REFERENCE TO SEAL EURO MOVE'",
        "text": "Former Rangers defender Jon Flanagan has signed for Danish side HB Koge on a two-year deal, 12 months after leaving Ibrox, and a glowing reference from Ibrox boss Steven Gerrard – via former Liverpool star Daniel Agger – helped the full-back land the move."
    },    
    {
        "headlines": "'Danish club reject Barnsley's N350m bid for ex-Manchester United winger of Nigerian descent'",
        "text": "The offer worth £500,000 (approximately N350 million in Nigerian currency) was rejected by Randers because it did not meet their valuation of the 2019 Nigeria U23 invitee."
    },    
    {
        "headlines": "'Brentford-bound midfielder Onyeka finally shows up for FCM training ahead of season opener'",
        "text": "Frank Onyeka has finally reported for training at Danish Superliga club FC Midtjylland, a day before their first competitive match of the new season against Odense Boldklub."
    },    
    {
        "headlines": "'Liel Abada: New Celtic signing revels in 'dream' switch from Israel'",
        "text": "The 19-year-old signed a five-year deal on Thursday, leaving Maccabi Petah Tikva in his homeland for an undisclosed fee."
    },    
    {
        "headlines": "'Scottish League Cup: Dundee United put six past Elgin as Motherwell and Arbroath also win'",
        "text": "Dundee United stormed to the top of their Scottish League Cup section with a 6-1 thumping of Elgin City."
    },    
    {
        "headlines": "'Leigh Griffiths: Police say 'no criminality' over Celtic's striker's online messages to teenage girls'",
        "text": "Celtic striker Leigh Griffiths has been cleared of criminality over alleged inappropriate social media messages to teenage girls."
    } 
    ]
}